This file documents the progress made to try to bin the Borough in order to 
group the taxi entries of lyft_Dec_23 by Borough done by AndHol996

In [1]:
import requests
import json
import pandas as pd

# Import dotenv package for setting environment variables 
from dotenv import load_dotenv

# Import os package
import os

In [2]:
# Read the lyft_Dec_23.parquet and taxi_zone_lookup.csv 
df = pd.read_parquet('Resources/lyft_Dec_23.parquet')
bins_df=pd.read_csv('Resources/taxi_zone_lookup.csv')
df.sort_index(inplace=True)
display(df.head())
df.tail()

,pickup_datetime,PULocationID,DOLocationID,trip_miles,trip_time,driver_pay,Total_Passenger_Cost
17,2023-12-01 00:50:08,256,132,17.227,2271,44.32,65.87
18,2023-12-01 00:09:21,40,97,1.934,677,8.98,15.73
19,2023-12-01 00:32:32,148,79,1.313,655,7.96,15.38
20,2023-12-01 00:47:13,107,256,4.059,1184,16.60,25.78
27,2023-12-01 00:46:08,129,138,1.436,189,5.47,11.99

,pickup_datetime,PULocationID,DOLocationID,trip_miles,trip_time,driver_pay,Total_Passenger_Cost
20516282,2023-12-31 23:03:55,164,234,1.246,1166,12.72,27.35
20516283,2023-12-31 23:31:29,234,164,0.979,777,8.93,30.28
20516290,2023-12-31 23:09:22,17,62,1.878,529,7.50,11.89
20516291,2023-12-31 23:23:47,62,17,1.977,726,9.51,28.94
20516292,2023-12-31 23:39:27,17,49,1.581,518,7.00,11.81

In [3]:
# Notice the that Borough, Zone, and service_zone are missing Non Null values
bins_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 265 entries, 0 to 264
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   LocationID    265 non-null    int64
 1   Borough       264 non-null    object
 2   Zone          264 non-null    object
 3   service_zone  263 non-null    object
dtypes: int64(1), object(3)
memory usage: 8.4+ KB

In [18]:
# Checking taxi entries going out from LGA
out_LGA_df=df.loc[df['PULocationID'].isin([138])]
out_LGA_df

,pickup_datetime,PULocationID,DOLocationID,trip_miles,trip_time,driver_pay,Total_Passenger_Cost
577,2023-12-01 00:13:36,138,209,9.631,1534,27.28,56.20
958,2023-12-01 00:04:34,138,112,7.297,1035,19.46,36.87
1714,2023-12-01 00:14:44,138,112,6.158,767,15.42,33.49
1963,2023-12-01 00:21:25,138,243,9.260,925,21.01,47.99
1976,2023-12-01 00:04:16,138,255,6.835,805,16.67,30.76
...,...,...,...,...,...,...,...
20514166,2023-12-31 23:56:40,138,265,94.031,6657,211.81,493.02
20514732,2023-12-31 23:50:56,138,198,6.310,1374,21.38,61.98
20514941,2023-12-31 23:57:39,138,224,9.637,1168,23.81,40.53
20515131,2023-12-31 23:53:31,138,181,14.971,1539,34.38,52.83
20515154,2023-12-31 23:53:29,138,39,15.767,1364,33.77,105.01

In [17]:
# Checking taxi entries going to LGA
in_LGA_df=df.loc[df['DOLocationID'].isin([138])]
in_LGA_df

,pickup_datetime,PULocationID,DOLocationID,trip_miles,trip_time,driver_pay,Total_Passenger_Cost
27,2023-12-01 00:46:08,129,138,1.436,189,5.47,11.99
6362,2023-12-01 00:41:34,37,138,8.771,1253,23.48,36.85
7435,2023-12-01 00:37:11,127,138,12.965,1240,28.90,41.89
16216,2023-12-01 00:15:10,41,138,7.528,918,18.66,38.97
21724,2023-12-01 00:47:08,70,138,0.843,190,5.47,14.63
...,...,...,...,...,...,...,...
20494623,2023-12-31 23:13:57,7,138,3.683,726,11.76,33.71
20500015,2023-12-31 23:08:11,70,138,0.884,688,7.70,10.99
20506817,2023-12-31 23:43:23,129,138,2.247,655,9.19,30.66
20506818,2023-12-31 23:56:17,138,138,2.502,622,9.21,16.35
20508300,2023-12-31 23:11:18,164,138,9.665,1480,26.82,100.80

In [19]:
# Checking all of the columns
bins_df

     LocationID         Borough                     Zone service_zone
0             1             EWR           Newark Airport          EWR
1             2          Queens              Jamaica Bay    Boro Zone
2             3           Bronx  Allerton/Pelham Gardens    Boro Zone
3             4       Manhattan            Alphabet City  Yellow Zone
4             5   Staten Island            Arden Heights    Boro Zone
..          ...             ...                      ...          ...
259         260          Queens                 Woodside    Boro Zone
260         261       Manhattan       World Trade Center  Yellow Zone
261         262       Manhattan           Yorkville East  Yellow Zone
262         263       Manhattan           Yorkville West  Yellow Zone
264         265  Outside of NYC           Outside of NYC          NaN

[264 rows x 4 columns]

In [23]:
# Checking to see if there are any inbound/outbound taxi entries that come from an unknown Burough
in_unknown_df=df.loc[df['DOLocationID'].isin([264])]
out_unknown_df=df.loc[df['PULocationID'].isin([264])]

display(in_unknown_df)
display(out_unknown_df)

Empty DataFrame
Columns: [pickup_datetime, PULocationID, DOLocationID, trip_miles, trip_time, driver_pay, Total_Passenger_Cost]
Index: []

Empty DataFrame
Columns: [pickup_datetime, PULocationID, DOLocationID, trip_miles, trip_time, driver_pay, Total_Passenger_Cost]
Index: []

In [7]:
# Drop service_zone since it is not pertinent to data analysis
bins_df.drop(columns="service_zone")

     LocationID        Borough                     Zone
0             1            EWR           Newark Airport
1             2         Queens              Jamaica Bay
2             3          Bronx  Allerton/Pelham Gardens
3             4      Manhattan            Alphabet City
4             5  Staten Island            Arden Heights
..          ...            ...                      ...
260         261      Manhattan       World Trade Center
261         262      Manhattan           Yorkville East
262         263      Manhattan           Yorkville West
263         264        Unknown                      NaN
264         265            NaN           Outside of NYC

[265 rows x 3 columns]

In [8]:
# Since there is only one non null in the Bourough Column, fill it with the same zone name.
bins_df['Borough'] = bins_df['Borough'].fillna("Outside of NYC")

In [9]:
# Set the bins_df column Borough to exclude the Unknown section
# Using the LocationID 264 shows no entries from the lyft_
bins_df = bins_df[bins_df.Borough != "Unknown"]

In [10]:
bins_df["Borough"].unique()

array(['EWR', 'Queens', 'Bronx', 'Manhattan', 'Staten Island', 'Brooklyn',
       'Outside of NYC'], dtype=object)

In [11]:
# Trying to group by Borough
group=bins_df.groupby(by=["Borough"])
group.head()

,LocationID,Borough,Zone,service_zone
0,1,EWR,Newark Airport,EWR
1,2,Queens,Jamaica Bay,Boro Zone
2,3,Bronx,Allerton/Pelham Gardens,Boro Zone
3,4,Manhattan,Alphabet City,Yellow Zone
4,5,Staten Island,Arden Heights,Boro Zone
5,6,Staten Island,Arrochar/Fort Wadsworth,Boro Zone
6,7,Queens,Astoria,Boro Zone
7,8,Queens,Astoria Park,Boro Zone
8,9,Queens,Auburndale,Boro Zone
9,10,Queens,Baisley Park,Boro Zone
10,11,Brooklyn,Bath Beach,Boro Zone
11,12,Manhattan,Battery Park,Yellow Zone
12,13,Manhattan,Battery Park City,Yellow Zone
13,14,Brooklyn,Bay Ridge,Boro Zone
16,17,Brooklyn,Bedford,Boro Zone
17,18,Bronx,Bedford Park,Boro Zone
19,20,Bronx,Belmont,Boro Zone
20,21,Brooklyn,Bensonhurst East,Boro Zone
21,22,Brooklyn,Bensonhurst West,Boro Zone
22,23,Staten Island,Bloomfield/Emerson Hill,Boro Zone
23,24,Manhattan,Bloomingdale,Yellow Zone
30,31,Bronx,Bronx Park,Boro Zone
31,32,Bronx,Bronxdale,Boro Zone
40,41,Manhattan,Central Harlem,Boro Zone
43,44,Staten Island,Charleston/Tottenville,Boro Zone
83,84,Staten Island,Eltingville/Annadale/Prince's Bay,Boro Zone
264,265,Outside of NYC,Outside of NYC,NaN

In [35]:
#Establishing the bins of each location ID
queens_bin=bins_df.loc[bins_df['Borough'] == 'Queens']

bronx_bin=bins_df.loc[bins_df['Borough'] == 'Bronx']

mh_bin=bins_df.loc[bins_df['Borough'] == 'Manhattan']

si_bin=bins_df.loc[bins_df['Borough'] == 'Staten Island']

brooklyn_bin=bins_df.loc[bins_df['Borough'] == 'Brooklyn']

out_of_nyc_bin=bins_df.loc[bins_df['Borough']== 'Outside of NYC']

newark_bin=bins_df.loc[bins_df['Borough'] == 'EWR']

bins_list=[queens_bin ,bronx_bin,mh_bin,si_bin,brooklyn_bin,out_of_nyc_bin,
           newark_bin]

bins_list

[     LocationID Borough           Zone service_zone
 1             2  Queens    Jamaica Bay    Boro Zone
 6             7  Queens        Astoria    Boro Zone
 7             8  Queens   Astoria Park    Boro Zone
 8             9  Queens     Auburndale    Boro Zone
 9            10  Queens   Baisley Park    Boro Zone
 ..          ...     ...            ...          ...
 225         226  Queens      Sunnyside    Boro Zone
 251         252  Queens     Whitestone    Boro Zone
 252         253  Queens  Willets Point    Boro Zone
 257         258  Queens      Woodhaven    Boro Zone
 259         260  Queens       Woodside    Boro Zone

 [69 rows x 4 columns],
      LocationID Borough                                 Zone service_zone
 2             3   Bronx              Allerton/Pelham Gardens    Boro Zone
 17           18   Bronx                         Bedford Park    Boro Zone
 19           20   Bronx                              Belmont    Boro Zone
 30           31   Bronx                           Bronx Park    Boro Zone
 31           32   Bronx                            Bronxdale    Boro Zone
 45           46   Bronx                          City Island    Boro Zone
 46           47   Bronx                   Claremont/Bathgate    Boro Zone
 50           51   Bronx                           Co-Op City    Boro Zone
 57           58   Bronx                         Country Club    Boro Zone
 58           59   Bronx                         Crotona Park    Boro Zone
 59           60   Bronx                    Crotona Park East    Boro Zone
 68           69   Bronx     East Concourse/Concourse Village    Boro Zone
 77           78   Bronx                         East Tremont    Boro Zone
 80           81   Bronx                          Eastchester    Boro Zone
 93           94   Bronx                        Fordham South    Boro Zone
 118         119   Bronx                           Highbridge    Boro Zone
 125         126   Bronx                          Hunts Point    Boro Zone
 135         136   Bronx                  Kingsbridge Heights    Boro Zone
 146         147   Bronx                             Longwood    Boro Zone
 158         159   Bronx                        Melrose South    Boro Zone
 166         167   Bronx                   Morrisania/Melrose    Boro Zone
 167         168   Bronx               Mott Haven/Port Morris    Boro Zone
 168         169   Bronx                           Mount Hope    Boro Zone
 173         174   Bronx                              Norwood    Boro Zone
 181         182   Bronx                          Parkchester    Boro Zone
 182         183   Bronx                           Pelham Bay    Boro Zone
 183         184   Bronx                      Pelham Bay Park    Boro Zone
 184         185   Bronx                       Pelham Parkway    Boro Zone
 198         199   Bronx                        Rikers Island    Boro Zone
 199         200   Bronx  Riverdale/North Riverdale/Fieldston    Boro Zone
 207         208   Bronx         Schuylerville/Edgewater Park    Boro Zone
 211         212   Bronx                   Soundview/Bruckner    Boro Zone
 212         213   Bronx                Soundview/Castle Hill    Boro Zone
 219         220   Bronx           Spuyten Duyvil/Kingsbridge    Boro Zone
 234         235   Bronx    University Heights/Morris Heights    Boro Zone
 239         240   Bronx                   Van Cortlandt Park    Boro Zone
 240         241   Bronx                Van Cortlandt Village    Boro Zone
 241         242   Bronx                 Van Nest/Morris Park    Boro Zone
 246         247   Bronx                       West Concourse    Boro Zone
 247         248   Bronx               West Farms/Bronx River    Boro Zone
 249         250   Bronx        Westchester Village/Unionport    Boro Zone
 253         254   Bronx             Williamsbridge/Olinville    Boro Zone
 258         259   Bronx                   Woodlawn/Wakefield    Boro Zone,
      LocationID    Borough                       Zone service_zone
 3             4  Manhattan              Alphabet City  Yellow Zone
 11           12  Manhattan               Battery Park  Yellow Zone
 12           13  Manhattan          Battery Park City  Yellow Zone
 23           24  Manhattan               Bloomingdale  Yellow Zone
 40           41  Manhattan             Central Harlem    Boro Zone
 ..          ...        ...                        ...          ...
 245         246  Manhattan  West Chelsea/Hudson Yards  Yellow Zone
 248         249  Manhattan               West Village  Yellow Zone
 260         261  Manhattan         World Trade Center  Yellow Zone
 261         262  Manhattan             Yorkville East  Yellow Zone
 262         263  Manhattan             Yorkville West  Yellow Zone

 [69 rows x 4 columns],
      LocationID        Borough                               Zone service_zone
 4             5  Staten Island                      Arden Heights    Boro Zone
 5             6  Staten Island            Arrochar/Fort Wadsworth    Boro Zone
 22           23  Staten Island            Bloomfield/Emerson Hill    Boro Zone
 43           44  Staten Island             Charleston/Tottenville    Boro Zone
 83           84  Staten Island  Eltingville/Annadale/Prince's Bay    Boro Zone
 98           99  Staten Island                    Freshkills Park    Boro Zone
 108         109  Staten Island                        Great Kills    Boro Zone
 109         110  Staten Island                   Great Kills Park    Boro Zone
 114         115  Staten Island                Grymes Hill/Clifton    Boro Zone
 117         118  Staten Island        Heartland Village/Todt Hill    Boro Zone
 155         156  Staten Island                    Mariners Harbor    Boro Zone
 171         172  Staten Island             New Dorp/Midland Beach    Boro Zone
 175         176  Staten Island                            Oakwood    Boro Zone
 186         187  Staten Island                      Port Richmond    Boro Zone
 203         204  Staten Island                  Rossville/Woodrow    Boro Zone
 205         206  Staten Island          Saint George/New Brighton    Boro Zone
 213         214  Staten Island           South Beach/Dongan Hills    Boro Zone
 220         221  Staten Island                          Stapleton    Boro Zone
 244         245  Staten Island                      West Brighton    Boro Zone
 250         251  Staten Island                        Westerleigh    Boro Zone,
      LocationID   Borough                       Zone service_zone
 10           11  Brooklyn                 Bath Beach    Boro Zone
 13           14  Brooklyn                  Bay Ridge    Boro Zone
 16           17  Brooklyn                    Bedford    Boro Zone
 20           21  Brooklyn           Bensonhurst East    Boro Zone
 21           22  Brooklyn           Bensonhurst West    Boro Zone
 ..          ...       ...                        ...          ...
 226         227  Brooklyn           Sunset Park East    Boro Zone
 227         228  Brooklyn           Sunset Park West    Boro Zone
 254         255  Brooklyn  Williamsburg (North Side)    Boro Zone
 255         256  Brooklyn  Williamsburg (South Side)    Boro Zone
 256         257  Brooklyn            Windsor Terrace    Boro Zone

 [61 rows x 4 columns],
      LocationID         Borough            Zone service_zone
 264         265  Outside of NYC  Outside of NYC          NaN,
    LocationID Borough            Zone service_zone
 0           1     EWR  Newark Airport          EWR]

In [36]:
#Dropping Zone and service_zone columns
for bin in bins_list: 
    bin.drop(columns=['Zone', 'service_zone'],inplace=True)

C:\Users\Andrew\AppData\Local\Temp\ipykernel_34840\958300510.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bin.drop(columns=['Zone', 'service_zone'],inplace=True)
C:\Users\Andrew\AppData\Local\Temp\ipykernel_34840\958300510.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bin.drop(columns=['Zone', 'service_zone'],inplace=True)
C:\Users\Andrew\AppData\Local\Temp\ipykernel_34840\958300510.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bin.drop(columns=['Zone', 'service_zone'],inplace=True)
C:\Users\Andrew\AppData\Local\Temp\ipykernel_34840\958300510.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bin.drop(columns=['Zone', 'service_zone'],inplace=True)
C:\Users\Andrew\AppData\Local\Temp\ipykernel_34840\958300510.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bin.drop(columns=['Zone', 'service_zone'],inplace=True)
C:\Users\Andrew\AppData\Local\Temp\ipykernel_34840\958300510.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bin.drop(columns=['Zone', 'service_zone'],inplace=True)
C:\Users\Andrew\AppData\Local\Temp\ipykernel_34840\958300510.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bin.drop(columns=['Zone', 'service_zone'],inplace=True)

[     LocationID Borough
 1             2  Queens
 6             7  Queens
 7             8  Queens
 8             9  Queens
 9            10  Queens
 ..          ...     ...
 225         226  Queens
 251         252  Queens
 252         253  Queens
 257         258  Queens
 259         260  Queens

 [69 rows x 2 columns],
      LocationID Borough
 2             3   Bronx
 17           18   Bronx
 19           20   Bronx
 30           31   Bronx
 31           32   Bronx
 45           46   Bronx
 46           47   Bronx
 50           51   Bronx
 57           58   Bronx
 58           59   Bronx
 59           60   Bronx
 68           69   Bronx
 77           78   Bronx
 80           81   Bronx
 93           94   Bronx
 118         119   Bronx
 125         126   Bronx
 135         136   Bronx
 146         147   Bronx
 158         159   Bronx
 166         167   Bronx
 167         168   Bronx
 168         169   Bronx
 173         174   Bronx
 181         182   Bronx
 182         183   Bronx
 183         184   Bronx
 184         185   Bronx
 198         199   Bronx
 199         200   Bronx
 207         208   Bronx
 211         212   Bronx
 212         213   Bronx
 219         220   Bronx
 234         235   Bronx
 239         240   Bronx
 240         241   Bronx
 241         242   Bronx
 246         247   Bronx
 247         248   Bronx
 249         250   Bronx
 253         254   Bronx
 258         259   Bronx,
      LocationID    Borough
 3             4  Manhattan
 11           12  Manhattan
 12           13  Manhattan
 23           24  Manhattan
 40           41  Manhattan
 ..          ...        ...
 245         246  Manhattan
 248         249  Manhattan
 260         261  Manhattan
 261         262  Manhattan
 262         263  Manhattan

 [69 rows x 2 columns],
      LocationID        Borough
 4             5  Staten Island
 5             6  Staten Island
 22           23  Staten Island
 43           44  Staten Island
 83           84  Staten Island
 98           99  Staten Island
 108         109  Staten Island
 109         110  Staten Island
 114         115  Staten Island
 117         118  Staten Island
 155         156  Staten Island
 171         172  Staten Island
 175         176  Staten Island
 186         187  Staten Island
 203         204  Staten Island
 205         206  Staten Island
 213         214  Staten Island
 220         221  Staten Island
 244         245  Staten Island
 250         251  Staten Island,
      LocationID   Borough
 10           11  Brooklyn
 13           14  Brooklyn
 16           17  Brooklyn
 20           21  Brooklyn
 21           22  Brooklyn
 ..          ...       ...
 226         227  Brooklyn
 227         228  Brooklyn
 254         255  Brooklyn
 255         256  Brooklyn
 256         257  Brooklyn

 [61 rows x 2 columns],
      LocationID         Borough
 264         265  Outside of NYC,
    LocationID Borough
 0           1     EWR]

In [37]:
display(queens_bin)
display(bronx_bin)
display(mh_bin)
display(si_bin)
display(newark_bin)
display(out_of_nyc_bin)

     LocationID Borough
1             2  Queens
6             7  Queens
7             8  Queens
8             9  Queens
9            10  Queens
..          ...     ...
225         226  Queens
251         252  Queens
252         253  Queens
257         258  Queens
259         260  Queens

[69 rows x 2 columns]

     LocationID Borough
2             3   Bronx
17           18   Bronx
19           20   Bronx
30           31   Bronx
31           32   Bronx
45           46   Bronx
46           47   Bronx
50           51   Bronx
57           58   Bronx
58           59   Bronx
59           60   Bronx
68           69   Bronx
77           78   Bronx
80           81   Bronx
93           94   Bronx
118         119   Bronx
125         126   Bronx
135         136   Bronx
146         147   Bronx
158         159   Bronx
166         167   Bronx
167         168   Bronx
168         169   Bronx
173         174   Bronx
181         182   Bronx
182         183   Bronx
183         184   Bronx
184         185   Bronx
198         199   Bronx
199         200   Bronx
207         208   Bronx
211         212   Bronx
212         213   Bronx
219         220   Bronx
234         235   Bronx
239         240   Bronx
240         241   Bronx
241         242   Bronx
246         247   Bronx
247         248   Bronx
249         250   Bronx
253         254   Bronx
258         259   Bronx

     LocationID    Borough
3             4  Manhattan
11           12  Manhattan
12           13  Manhattan
23           24  Manhattan
40           41  Manhattan
..          ...        ...
245         246  Manhattan
248         249  Manhattan
260         261  Manhattan
261         262  Manhattan
262         263  Manhattan

[69 rows x 2 columns]

     LocationID        Borough
4             5  Staten Island
5             6  Staten Island
22           23  Staten Island
43           44  Staten Island
83           84  Staten Island
98           99  Staten Island
108         109  Staten Island
109         110  Staten Island
114         115  Staten Island
117         118  Staten Island
155         156  Staten Island
171         172  Staten Island
175         176  Staten Island
186         187  Staten Island
203         204  Staten Island
205         206  Staten Island
213         214  Staten Island
220         221  Staten Island
244         245  Staten Island
250         251  Staten Island

   LocationID Borough
0           1     EWR

     LocationID         Borough
264         265  Outside of NYC

Stopped here because another way that was simpler was utilized to group by Borough as seen in Util.py file.